{
    "programming_languages": ["C", "C++", "Java", "GoLang"],
    "scripting_languages": ["Python", "ReactJS", "Svelte", "Javascript", "PHP"],
    "design_tools": ["Adobe Illustrator", "Adobe Photoshop", "Adobe Premier", "Figma"],
    "all_of_it": ["C", "C++", "Java", "GoLang", "Python", "ReactJS", "Svelte", "Javascript", "PHP", "Adobe Illustrator", "Adobe Photoshop", "Adobe Premier", "Figma"],
    "used_it": {"C": ["CS 135", "CS 202", "CS 218", "CS 302", "CS 370"],
    "C++": ["CS 135", "CS 202", "CS 218", "CS 302", "CS 377"],
    "Java": ["CS 326", "CS 460"],
    "GoLang": ["Self Taught"],
    "Python": ["CompSci 242P", "CompSci 296P"],
    "ReactJS": ["Self Taught"],
    "Svelte": ["Self Taught"],
    "Javascript": ["Self Taught"],
    "PHP": ["Learned in High School"],
    "Adobe Illustrator": ["Certified in High School"],
    "Adobe Photoshop": ["Certified in High School"],
    "Adobe Premier": ["Self Taught"],
    "Figma": ["Self Taught"]},
    "projects": {
        "C": ["Operating Systems in UNLV", "Data Structures in UNLV"],
        "C++": ["Data Structures in UNLV", "Algorithms in UNLV & UCI"],
        "Java": ["Compilers in UNLV", "Programming Languages in UNLV"],
        "GoLang": ["Data Structures Practice Project"],
        "Python": ["Compilers in UCI", "Machine Learning Course Work in UNLV & UCI", "ThisMuch", "Accredidation Software"],
        "ReactJS": ["ThisMuch", "Accrediation Software"],
        "Svelte": ["Personal Portfolio", "Demerit Software"],
        "Javascript": ["Personal Portfolio", "ThisMuch", "Accrediation Software", "Demerit Software"],
        "PHP": ["Wordpress plugins"],
        "Adobe Illustrator": ["Personal Portfolio", "Personal Art Projects"],
        "Adobe Photoshop": ["Personal Portfolio", "Demerit Software", "ThisMuch"],
        "Adobe Premier": ["ThisMuch"],
        "Figma": ["ThisMuch"]
    },
    "desc": {
        "C": "This was mostly used to teach memory management at UNLV and was a great introductory programming languages to pick up. Though it became a little difficult when objects needed to be used.",
        "C++": "Similarly to C, UNLV taught C++ to teach it's students how to use OOP (Object Orient Programming), as well as some threading concepts.",
        "Java": "At UNLV, java was used during Programming Languages (CS 326), and Compilers (CS 460), which were sister courses. Usually the professors of CS325 where PHd students for the professor of CS460. That being said, java was used as the main language in this course because we were programming and exanding the virutal compiler for the espresso language, a Java virtual language.",
        "GoLang": "When I went to graduate school, one of my friends had mentioned that he uses GoLang as his choice to program servers, and after trying it out for a while, I throughly enjoyed it, and wanted to keep using it",
        "Python": "One of my favorite tools in my arsenal, simply because Python has no reason to be as powerful as it is, and so easy to understand. I can quickly jump from programming a machine to read pages and write its own story, to writing a script to automate a task.",
        "ReactJS": "This one was more of a necessity. For my capstone progject CompSci 296P at UCI, my team and I used React Native and NextJs to build our app ThisMuch. After the course though, I really liked the way the framework was built, and continued using it.",
        "Svelte": "This was a framework I stumbled on, or a compiler really, that I fell in love with very quickly. It's incredibly easy to pick up, and even easier to use. With Sveltekit allowing developers to build whole front and backend frameworks quickly, it's become my new favorite tool to use.",
        "Javascript": "My second programming language I learned, I was introduced to Vanilla JS because I was a web developer student at my high school SouthWest Career and Technical Academy in Las Vegas. I really enjoyed how simple the language was, and easy it was to build websites with it.",
        "PHP": "This was actually my first language I ever learned. My web design professor in High School as adament we learned this scripting language, and for many of use, it stuck because it taught best practices and useful skills. Mostly because if you mess up in PHP, everything just stops working.",
        "Adobe Illustrator": "At my high school, for vocational students in web design, we had to also take courses in design, where many of us became certified in some of the Adobe Suite, mostly the ones we picked. I enjoy working with Illustrator, and continue using it to this day.",
        "Adobe Photoshop": "Similarly to Adobe Illustrator, this was one of the Adobe Suite softwares that was taught in my High School. It definately took my longer to adopt Photoshop in my tool-kit, but I'm constantly using it today, and I love it.",
        "Adobe Premier": "Simply put, I had to learn this for courses in my graduate program. For our capstone, we had to film promotional videos of our software, and in order to edit, and clip them together, I used Premier to edit and render our videos.",
        "Figma": "Also used during my UCI Capstone project, and now part of my daily design cycle, I used figma to create a design language for my capstone, as well as a design language for sites that I am making, even this personal portfolio."
    }
}